laureati = {
        'Петер Хандке': '2019', 'Светлана Алексеевич': '2015',
        'Патрик Модиано': '2014', 'Элис Энн Манро': '2013', 'Мо Янь':
        '2012', 'Тумас Транстремер': '2011', 'Марио Варгас Льоса': '2010',
        'Герта Мюллер': '2009', 'Жан-Мари Гюстав Леклезио': '2008',
        'Дорис Лессинг': '2007', 'Орхан Памук': '2006', 'Гарольд Пинтер':
        '2005', 'Эльфрида Елинек': '2004', 'Джон Максвелл Кутзее': '2003',
        'Имре Кертес': '2002', 'Видиадхар Сураджпрасад Найпол': '2001',
        'Гао Синцзянь': '2000', 'Гюнтер Грасс': '1999', 'Жозе Сарамаго':
        '1998', 'Дарио Фо': '1997', 'Вислава Шимборска': '1996',
        'Шеймус Хини': '1995', 'Кэнзабуро Оэ': '1994', 'Тони Моррисон':
        '1988', 'Иосиф Бродский': '1987', 'Воле Шойинка': '1986',
        'Клод Симон': '1985', 'Ярослав Сейферт': '1984', 'Уильям Голдинг':
        '1983', 'Габриэль Гарсия Маркес': '1982', 'Ольга Токарчук': '2018',
        'Кадзуо Исигуро': '2017', 'Боб Дилан': '2016', 'Перл Бак': '1938',
        'Патрик Виктор Мартиндейл Уайт': '1973', 'Юджин ОНил': '1936',
        'Хасинто Бенавенте - И - Мартинес': '1922', 'Нелли Закс': '1966',
        'Александр Исаевич Солженицын': '1970', 'Генрих Белль': '1972',
        'Пабло Неруда': '1971', 'Сэмюэл Беккет': '1969', 'Ясунари Кавабата':
        '1968', 'Мигель Астуриас': '1967', 'Шмуэль Йозеф Агнон': '1966',
        'Михаил Александрович Шолохов': '1965', 'Жан-Поль Сартр': '1964',
        'Георгос Сеферис': '1963', 'Джон Стейнбек': '1962', 'Иво Андрич':
        '1961', 'Сен-Жон Перс': '1960', 'Сальваторе Квазимодо': '1959',
        'Борис Леонидович Пастернак': '1958', 'Альбер Камю': '1957',
        'Хуан Рамон Хименес': '1956', 'Хальдоур Кильян Лакснесс': '1955',
        'Эрнест Миллер Хемингуэй': '1954', 'Андре Жид': '1947',
        'Уинстон Леонард Спенсер Черчилль': '1953', 'Герман Гессе': '1946',
        'Франсуа Мориак': '1952', 'Пер Фабиан Лагерквист': '1951',
        'Бертран Рассел': '1950', 'Уильям Фолкнер': '1949',
        'Томас Стернз Элиот': '1948', 'Габриела Мистраль': '1945',
        'Йоханнес Йенсен': '1944', 'Франс Эмиль Силланпя': '1939',
        'Роже Мартен Дю Гар': '1937', 'Луиджи Пиранделло': '1934',
        'Иван Алексеевич Бунин': '1933', 'Джон Голсуорси': '1932',
        'Эрик Карлфельдт': '1931', 'Синклер Льюис': '1930'
}
name = input()
print(laureati[name])
